syms x;
f(x) = (x^2 + 1)^(-1);
inputs = linspace(-5, 5, 21);
outputs = zeros(21, 21);

for i = 1:21
    outputs(i, 1) = f(inputs(i));
end

for i = 1:20
    for j = 1:i
        outputs(i+1, j+1) = outputs(i+1, j) - outputs(i, j);
    end
end

s = (x-inputs(1)) / (inputs(2) - inputs(1));


syms P(x);

P(x) = outputs(1, 1);
for k = 1:20
    P(x) = P(x) + nchoosek(s, k) * outputs(k+1, k+1);
end

disp(P(x));

% 단순화된 기호 표현식 구하기
simplifiedExpr = expand((19*x)/1105 + (7*nchoosek((2*x + 10), 2))/2210 + (sym("61826929060119")*nchoosek((2*x + 10), 3))/sym("36028797018963968") + (15*nchoosek((2*x + 10), 4))/11713 + (sym("5608335690605")*nchoosek((2*x + 10), 5))/sym("4503599627370496") + (sym("103861603938369")*nchoosek((2*x + 10), 6))/sym("72057594037927936") + (sym("25392634786393")*nchoosek((2*x + 10), 7))/sym("18014398509481984") - (sym("109589265920223")*nchoosek((2*x + 10), 8))/sym("36028797018963968") - (sym("1323089917817733")*nchoosek((2*x + 10), 9))/sym("36028797018963968") - (sym("210491577834615")*nchoosek((2*x + 10), 10))/sym("9007199254740992") + (sym("3870038009616717")*nchoosek((2*x + 10), 11))/sym("4503599627370496") - (sym("3919653881534891")*nchoosek((2*x + 10), 12))/sym("1125899906842624") + (sym("7988155378824295")*nchoosek((2*x + 10), 13))/sym("1125899906842624") - (sym("3473111034271553")*nchoosek((2*x + 10), 14))/sym("1125899906842624") - (sym("5209666551407073")*nchoosek((2*x + 10), 15))/sym("140737488355328") + (sym("6381841525473693")*nchoosek((2*x + 10), 16))/sym("35184372088832") - (sym("2490871819891521")*nchoosek((2*x + 10), 17))/sym("4398046511104") + (sym("196888765175249")*nchoosek((2*x + 10), 18))/sym("137438953472") - (sym("6959788908520431")*nchoosek((2*x + 10), 19))/sym("2199023255552") + (sym("6959788908520431")*nchoosek((2*x + 10), 20))/sym("1099511627776") + sym(55/442))

% Plot P(x)-f(x)
X = linspace(-5, 5, 51);
Y = zeros(1, 51);
for i = 1:51
    Y(i) = P(X(i)) - f(X(i));
end
plot(X, Y);
ylim([-10 10]);
